----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /hpchome/econ/tmr17/HSsports/NELS88analysis/NELS88reg05_a.log
  log type:  text
 opened on:  22 Feb 2018, 19:00:04

. 
. /* Increase memory size to allow for dataset */
. 
. set maxvar 10000


. 
. /* Open Stata dataset */
. use NELS88regdata4.dta

. gen by72 = BIRTHYR==1972

. gen race_other = race_native==1 | race_api==1

. gen tot_irt = math_irt + read_irt

. 
. 
. preserve

.     ren sport athlete

.     drop race_native race_api

.     gen loginc = log(inc99)
(1033 missing values generated)

.     drop if female
(4742 observations deleted)

.     *===================================================
.     * Summary statistics for descriptive stats tables
.     *===================================================
. 
.     foreach var of varlist by* race_* hh_* ed_* inc_* frqabsent handicap enr? cont_* urban? college_grad post_second loginc workft fit_active binge_drink voter {
  2.         gen `var'_100 = 100*`var'
  3.     }
(31 missing values generated)
(363 missing values generated)
(3 missing values generated)
(14 missing values generated)

. 
.     qui clonevar tempirt = tot_irt

.     qui clonevar temploginc   = loginc

.     qui replace  temploginc   = . if mi(loginc)

. 
.     qui ds *_100

.     local discretevars `r(varlist)'

. 
.     local contvars tempirt temploginc

. 
.     lab var race_white_100         "White"

.     lab var race_black_100         "Black"

.     lab var race_hisp_100          "Hispanic"

.     lab var race_other_100         "Other"

.     lab var ed_mother_100          "Mother: college degree or higher"

.     lab var ed_father_100          "Father: college degree or higher"

.     lab var hh_mother_100          "Coresidence with Mother"

.     lab var hh_father_100          "Coresidence with Father"

.     lab var inc_high_100           "Family income > 50k"

.     lab var inc_low_100            "Family income < 20k"

.     lab var by72_100               "Born in 1972"

.     lab var by73_100               "Born in 1973"

.     lab var by74_100               "Born in 1974"

.     lab var by75_100               "Born in 1975"

.     lab var frqabsent_100           "Frequently absent"

.     lab var handicap_100           "Has handicap"

.     lab var enr1_100               "School size decile 1"

.     lab var enr2_100               "School size decile 2"

.     lab var enr3_100               "School size decile 3"

.     lab var enr4_100               "School size decile 4"

.     lab var enr5_100               "School size decile 5"

.     lab var enr6_100               "School size decile 6"

.     lab var enr7_100               "School size decile 7"

.     lab var enr8_100               "School size decile 8"

.     lab var enr9_100               "School size decile 9"

.     lab var cont_public_100        "Public school"

.     lab var cont_catholic_100      "Catholic school"

.     lab var cont_religious_100     "Non-Catholic religious school"

.     lab var cont_private_100       "Non-religious private school"

.     lab var urban1_100              "Urbanicity quintile 1"

.     lab var urban2_100              "Urbanicity quintile 2"

.     lab var urban3_100              "Urbanicity quintile 3"

.     lab var urban4_100              "Urbanicity quintile 4"

.     lab var urban5_100              "Urbanicity quintile 5"

.     lab var post_second_100        "Attended college"

.     lab var college_grad_100       "Graduated 4-year college"

.     lab var workft_100             "Employed full-time"

.     lab var binge_drink_100        "Alcohol abuse"

.     lab var voter_100              "Voter"

.     lab var fit_active_100         "Regular exercise"

.     capture lab var tempirt        "Colmbined IRT score"

.     capture lab var temploginc     "Log income"

. 
.     *-----------------------------------------
.     * Create summary stats tables
.     *-----------------------------------------
.     qui ds tempirt race_white_100 race_black_100 race_hisp_100 race_other_100 ed_mother_100 ed_father_100 inc_low_100 inc_high_100 hh_mother_100 hh_father_100 by72_100 by73_100 by74_100 by
> 75_100 frqabsent_100 handicap_100 enr1_100 enr2_100 enr3_100 enr4_100 enr5_100 enr6_100 enr7_100 enr8_100 enr9_100 cont_public_100 cont_catholic_100 cont_religious_100 cont_private_100 urb
> an1_100 urban2_100 urban3_100 urban4_100 urban5_100 post_second_100 college_grad_100 temploginc workft_100 fit_active_100 binge_drink_100 voter_100

.     local allvars `r(varlist)'

. 
.     qui gen holderOverall      = ""

.     qui gen holderOverallPflag = 0

.     qui gen holderAthlete0     = ""

.     qui gen holderAthlete1     = ""

.     qui gen holderName         = ""

.     qui gen fmtInd             = 0

.     local i = 1

.     foreach var in `allvars' {
  2.         local test = 0
  3.         foreach var2 in `discretevars' {
  4.             if "`var'"=="`var2'" {
  5.                 local test = 1
  6.                 continue, break
  7.             }
  8.         }
  9.         if "`test'"=="1" {
 10.             di "`var'"
 11.             local varlab: variable label `var'
 12.             qui replace holderName = "`varlab'" if _n==`i'
 13.             qui replace fmtInd     = 1          if _n==`i'
 14.             qui sum `var' [aw=F4QWT] , d
 15.             local temp: di %3.2f `r(mean)'
 16.             qui replace holderOverall = "`temp'" if _n==`i'
 17.             qui ttest `var' , by(athlete)
 18.             qui replace holderOverallPflag = (`r(p)'<.05) if _n==`i'
 19.             foreach a in 0 1 {
 20.                 qui sum `var' [aw=F4QWT] if athlete==`a', d
 21.                 local temp: di %3.2f `r(mean)'
 22.                 qui replace holderAthlete`a' = "`temp'" if _n==`i'
 23.             }
 24.             local i = `=`i'+1'
 25.         }
 26.         else {
 27.             di "`var'"
 28.             local varlab: variable label `var'
 29.             qui replace holderName = "`varlab'" if _n==`i'
 30.             qui replace fmtInd     = 1          if _n==`i'
 31.             qui sum `var' [aw=F4QWT], d
 32.             local temp1: di %3.2f `r(mean)'
 33.             local temp2: di %3.2f `r(sd)'
 34.             qui replace holderOverall = "`temp1'"   if _n==`i'
 35.             qui replace holderOverall = "(`temp2')" if _n==`=`i'+1'
 36.             qui ttest `var' , by(athlete)
 37.             qui replace holderOverallPflag = (`r(p)'<.05) if _n==`i'
 38.             foreach a in 0 1 {
 39.                 qui sum `var' [aw=F4QWT] if athlete==`a', d
 40.                 local temp1: di %3.2f `r(mean)'
 41.                 local temp2: di %3.2f `r(sd)'
 42.                 qui replace holderAthlete`a' = "`temp1'"   if _n==`i'
 43.                 qui replace holderAthlete`a' = "(`temp2')" if _n==`=`i'+1'
 44.             }
 45.             local i = `=`i'+2'
 46.         }
 47.         * Sample Sizes
.         qui replace holderName = "N" if _n==`i'
 48.         qui count 
 49.         local tempN: di %9.0fc `r(N)'
 50.         qui replace holderOverall = "`tempN'" if _n==`i'
 51.         foreach a in 0 1 {
 52.             qui count if athlete==`a'
 53.             local tempN: di %9.0fc `r(N)'
 54.             qui replace holderAthlete`a' = "`tempN'" if _n==`i'
 55.         }
 56.     }
tempirt
race_white_100
race_black_100
race_hisp_100
race_other_100
ed_mother_100
ed_father_100
inc_low_100
inc_high_100
hh_mother_100
hh_father_100
by72_100
by73_100
by74_100
by75_100
frqabsent_100
handicap_100
enr1_100
enr2_100
enr3_100
enr4_100
enr5_100
enr6_100
enr7_100
enr8_100
enr9_100
cont_public_100
cont_catholic_100
cont_religious_100
cont_private_100
urban1_100
urban2_100
urban3_100
urban4_100
urban5_100
post_second_100
college_grad_100
temploginc
workft_100
fit_active_100
binge_drink_100
voter_100

. 
.     * Add asterisk if athletes are significantly different from non-athletes
.     replace holderAthlete1 = "$"+holderAthlete1+"^{\ast}$" if holderOverallPflag==1
holderAthlete1 was str9 now str14
(23 real changes made)

. 
.     qui listtex holderName holderAthlete0 holderAthlete1 holderOverall in 1/`=`i'' using sumStatsTableSport.tex, replace delimiter(" & ") end ("   \tabularnewline")

. 
.     drop *_100

. restore

. 
. preserve

.     ren sport athlete

.     drop race_native race_api

.     gen loginc = log(inc99)
(1033 missing values generated)

.     drop if !female
(4227 observations deleted)

.     *===================================================
.     * Summary statistics for descriptive stats tables
.     *===================================================
. 
.     foreach var of varlist by* race_* hh_* ed_* inc_* frqabsent handicap enr? cont_* urban? college_grad post_second loginc workft fit_active binge_drink voter {
  2.         gen `var'_100 = 100*`var'
  3.     }
(37 missing values generated)
(670 missing values generated)
(1 missing value generated)
(2 missing values generated)
(11 missing values generated)

. 
.     qui clonevar tempirt = tot_irt

.     qui clonevar temploginc   = loginc

.     qui replace  temploginc   = . if mi(loginc)

. 
.     qui ds *_100

.     local discretevars `r(varlist)'

. 
.     local contvars tempirt temploginc

. 
.     lab var race_white_100         "White"

.     lab var race_black_100         "Black"

.     lab var race_hisp_100          "Hispanic"

.     lab var race_other_100         "Other"

.     lab var ed_mother_100          "Mother: college degree or higher"

.     lab var ed_father_100          "Father: college degree or higher"

.     lab var hh_mother_100          "Coresidence with Mother"

.     lab var hh_father_100          "Coresidence with Father"

.     lab var inc_high_100           "Family income > 50k"

.     lab var inc_low_100            "Family income < 20k"

.     lab var by72_100               "Born in 1972"

.     lab var by73_100               "Born in 1973"

.     lab var by74_100               "Born in 1974"

.     lab var by75_100               "Born in 1975"

.     lab var frqabsent_100           "Frequently absent"

.     lab var handicap_100           "Has handicap"

.     lab var enr1_100               "School size decile 1"

.     lab var enr2_100               "School size decile 2"

.     lab var enr3_100               "School size decile 3"

.     lab var enr4_100               "School size decile 4"

.     lab var enr5_100               "School size decile 5"

.     lab var enr6_100               "School size decile 6"

.     lab var enr7_100               "School size decile 7"

.     lab var enr8_100               "School size decile 8"

.     lab var enr9_100               "School size decile 9"

.     lab var cont_public_100        "Public school"

.     lab var cont_catholic_100      "Catholic school"

.     lab var cont_religious_100     "Non-Catholic religious school"

.     lab var cont_private_100       "Non-religious private school"

.     lab var urban1_100              "Urbanicity quintile 1"

.     lab var urban2_100              "Urbanicity quintile 2"

.     lab var urban3_100              "Urbanicity quintile 3"

.     lab var urban4_100              "Urbanicity quintile 4"

.     lab var urban5_100              "Urbanicity quintile 5"

.     lab var post_second_100        "Attended college"

.     lab var college_grad_100       "Graduated 4-year college"

.     lab var workft_100             "Employed full-time"

.     lab var binge_drink_100        "Alcohol abuse"

.     lab var voter_100              "Voter"

.     lab var fit_active_100         "Regular exercise"

.     capture lab var tempirt        "Colmbined IRT score"

.     capture lab var temploginc     "Log income"

. 
.     *-----------------------------------------
.     * Create summary stats tables
.     *-----------------------------------------
.     qui ds tempirt race_white_100 race_black_100 race_hisp_100 race_other_100 ed_mother_100 ed_father_100 inc_low_100 inc_high_100 hh_mother_100 hh_father_100 by72_100 by73_100 by74_100 by
> 75_100 frqabsent_100 handicap_100 enr1_100 enr2_100 enr3_100 enr4_100 enr5_100 enr6_100 enr7_100 enr8_100 enr9_100 cont_public_100 cont_catholic_100 cont_religious_100 cont_private_100 urb
> an1_100 urban2_100 urban3_100 urban4_100 urban5_100 post_second_100 college_grad_100 temploginc workft_100 fit_active_100 binge_drink_100 voter_100

.     local allvars `r(varlist)'

. 
.     qui gen holderOverall      = ""

.     qui gen holderOverallPflag = 0

.     qui gen holderAthlete0     = ""

.     qui gen holderAthlete1     = ""

.     qui gen holderName         = ""

.     qui gen fmtInd             = 0

.     local i = 1

.     foreach var in `allvars' {
  2.         local test = 0
  3.         foreach var2 in `discretevars' {
  4.             if "`var'"=="`var2'" {
  5.                 local test = 1
  6.                 continue, break
  7.             }
  8.         }
  9.         if "`test'"=="1" {
 10.             di "`var'"
 11.             local varlab: variable label `var'
 12.             qui replace holderName = "`varlab'" if _n==`i'
 13.             qui replace fmtInd     = 1          if _n==`i'
 14.             qui sum `var' [aw=F4QWT], d
 15.             local temp: di %3.2f `r(mean)'
 16.             qui replace holderOverall = "`temp'" if _n==`i'
 17.             qui ttest `var' , by(athlete)
 18.             qui replace holderOverallPflag = (`r(p)'<.05) if _n==`i'
 19.             foreach a in 0 1 {
 20.                 qui sum `var' [aw=F4QWT] if athlete==`a', d
 21.                 local temp: di %3.2f `r(mean)'
 22.                 qui replace holderAthlete`a' = "`temp'" if _n==`i'
 23.             }
 24.             local i = `=`i'+1'
 25.         }
 26.         else {
 27.             di "`var'"
 28.             local varlab: variable label `var'
 29.             qui replace holderName = "`varlab'" if _n==`i'
 30.             qui replace fmtInd     = 1          if _n==`i'
 31.             qui sum `var' [aw=F4QWT], d
 32.             local temp1: di %3.2f `r(mean)'
 33.             local temp2: di %3.2f `r(sd)'
 34.             qui replace holderOverall = "`temp1'"   if _n==`i'
 35.             qui replace holderOverall = "(`temp2')" if _n==`=`i'+1'
 36.             qui ttest `var' , by(athlete)
 37.             qui replace holderOverallPflag = (`r(p)'<.05) if _n==`i'
 38.             foreach a in 0 1 {
 39.                 qui sum `var' [aw=F4QWT] if athlete==`a', d
 40.                 local temp1: di %3.2f `r(mean)'
 41.                 local temp2: di %3.2f `r(sd)'
 42.                 qui replace holderAthlete`a' = "`temp1'"   if _n==`i'
 43.                 qui replace holderAthlete`a' = "(`temp2')" if _n==`=`i'+1'
 44.             }
 45.             local i = `=`i'+2'
 46.         }
 47.         * Sample Sizes
.         qui replace holderName = "N" if _n==`i'
 48.         qui count 
 49.         local tempN: di %9.0fc `r(N)'
 50.         qui replace holderOverall = "`tempN'" if _n==`i'
 51.         foreach a in 0 1 {
 52.             qui count if athlete==`a'
 53.             local tempN: di %9.0fc `r(N)'
 54.             qui replace holderAthlete`a' = "`tempN'" if _n==`i'
 55.         }
 56.     }
tempirt
race_white_100
race_black_100
race_hisp_100
race_other_100
ed_mother_100
ed_father_100
inc_low_100
inc_high_100
hh_mother_100
hh_father_100
by72_100
by73_100
by74_100
by75_100
frqabsent_100
handicap_100
enr1_100
enr2_100
enr3_100
enr4_100
enr5_100
enr6_100
enr7_100
enr8_100
enr9_100
cont_public_100
cont_catholic_100
cont_religious_100
cont_private_100
urban1_100
urban2_100
urban3_100
urban4_100
urban5_100
post_second_100
college_grad_100
temploginc
workft_100
fit_active_100
binge_drink_100
voter_100

. 
.     * Add asterisk if athletes are significantly different from non-athletes
.     replace holderAthlete1 = "$"+holderAthlete1+"^{\ast}$" if holderOverallPflag==1
holderAthlete1 was str9 now str14
(29 real changes made)

. 
.     qui listtex holderName holderAthlete0 holderAthlete1 holderOverall in 1/`=`i'' using sumStatsTableSportFemale.tex, replace delimiter(" & ") end ("   \tabularnewline")

. 
.     drop *_100

. restore

. 
. 
. 
. 
. xtset F1SCH_ID
       panel variable:  F1SCH_ID (unbalanced)

. 
. /*  Higher Ed Analysis  */
. 
. reg college_grad sport if female, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4705
                                                       F(  1,  1100) =  162.26
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0347
                                                       Root MSE      =  .48631

                            (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
college_grad |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       sport |   .1843148   .0144693    12.74   0.000     .1559242    .2127054
       _cons |    .337126   .0110523    30.50   0.000       .31544     .358812
------------------------------------------------------------------------------

. 
. reg college_grad sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priv
> ate urban2 urban3 urban4   if female, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4705
                                                       F( 32,  1100) =  118.66
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.3204
                                                       Root MSE      =  .40939

                              (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
--------------------------------------------------------------------------------
               |               Robust
  college_grad |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         sport |    .086095   .0124181     6.93   0.000     .0617292    .1104609
          by73 |   .0254555   .0375605     0.68   0.498    -.0482428    .0991537
          by74 |   .0698259   .0375932     1.86   0.064    -.0039364    .1435883
          by75 |   .0706537   .0610544     1.16   0.247    -.0491425    .1904499
   race_native |  -.0921073   .0506564    -1.82   0.069    -.1915014    .0072868
    race_black |    .080688   .0217264     3.71   0.000     .0380581     .123318
     race_hisp |   -.050877   .0204266    -2.49   0.013    -.0909566   -.0107975
      race_api |   .0958508   .0255209     3.76   0.000     .0457756     .145926
     hh_father |    .087976   .0147437     5.97   0.000     .0590471    .1169049
     hh_mother |   .0865276   .0287839     3.01   0.003       .03005    .1430051
     ed_mother |   .0754672   .0183324     4.12   0.000     .0394968    .1114375
     ed_father |   .1255138   .0178268     7.04   0.000     .0905354    .1604923
       inc_low |   .0065469   .0160519     0.41   0.683    -.0249489    .0380428
      inc_high |   .0826801   .0163042     5.07   0.000     .0506892     .114671
      math_irt |    .009183   .0007884    11.65   0.000      .007636    .0107299
      read_irt |   .0098807   .0010505     9.41   0.000     .0078194    .0119419
     frqabsent |  -.1116626   .0236223    -4.73   0.000    -.1580126   -.0653127
      handicap |   .0297154   .0460148     0.65   0.519    -.0605713    .1200021
          enr2 |   .0282001   .0251903     1.12   0.263    -.0212263    .0776266
          enr3 |   .0511089   .0239924     2.13   0.033     .0040328     .098185
          enr4 |   .0170503   .0263734     0.65   0.518    -.0346976    .0687981
          enr5 |    .062132   .0246618     2.52   0.012     .0137425    .1105215
          enr6 |   .0494313   .0254107     1.95   0.052    -.0004276    .0992902
          enr7 |   .0607958   .0300644     2.02   0.043     .0018056    .1197859
          enr8 |    .063296   .0335915     1.88   0.060    -.0026147    .1292067
          enr9 |   .1169476   .0322694     3.62   0.000      .053631    .1802642
 cont_catholic |   .1250594   .0303387     4.12   0.000     .0655312    .1845876
cont_religious |    .107793   .0392835     2.74   0.006      .030714    .1848721
  cont_private |   .1156202   .0392364     2.95   0.003     .0386335    .1926069
        urban2 |    .019639   .0174529     1.13   0.261    -.0146058    .0538838
        urban3 |   .0049933   .0218531     0.23   0.819    -.0378852    .0478719
        urban4 |   .0919494   .0358812     2.56   0.011      .021546    .1623527
         _cons |  -.6065626   .0549934   -11.03   0.000    -.7144665   -.4986587
--------------------------------------------------------------------------------

. 
. rcr college_grad sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priv
> ate urban2 urban3 urban4   if female, clust(F1SCH_ID) lambda(-1 0)
(68 missing values generated)
(68 missing values generated)


RCR model                                             Number of obs =     4705
                                             Lower bound on lambda  =       -1
                                             Upper bound on lambda  =        0


                            (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
college_grad |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   3.426102   .2068227    16.57   0.000     3.020737    3.831467
    betaxInf |   1.337236   .1111337    12.03   0.000     1.119417    1.555054
     lambda0 |   .5106161   .0886792     5.76   0.000     .3368081    .6844242
      betaxL |    .086095   .0123758     6.96   0.000     .0618389    .1103512
      betaxH |   .2378852   .0186197    12.78   0.000     .2013913    .2743792
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)      .0618389    .2743792
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr college_grad sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priv
> ate urban2 urban3 urban4   if female, clust(F1SCH_ID) lambda(0 .5)
(68 missing values generated)
(68 missing values generated)


RCR model                                             Number of obs =     4705
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =       .5


                            (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
college_grad |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   3.426102   .2068227    16.57   0.000     3.020737    3.831467
    betaxInf |   1.337236   .1111337    12.03   0.000     1.119417    1.555054
     lambda0 |   .5106161   .0886792     5.76   0.000     .3368081    .6844242
      betaxL |   .0018725   .0155426     0.12   0.904    -.0285904    .0323355
      betaxH |    .086095   .0123758     6.96   0.000     .0618389    .1103512
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.0285904    .1103512
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr college_grad sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priv
> ate urban2 urban3 urban4   if female, clust(F1SCH_ID)
(68 missing values generated)
(68 missing values generated)


RCR model                                             Number of obs =     4705
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =        1


                            (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
college_grad |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   3.426102   .2068227    16.57   0.000     3.020737    3.831467
    betaxInf |   1.337236   .1111337    12.03   0.000     1.119417    1.555054
     lambda0 |   .5106161   .0886792     5.76   0.000     .3368081    .6844242
      betaxL |   -.091337   .0228767    -3.99   0.000    -.1361745   -.0464995
      betaxH |    .086095   .0123758     6.96   0.000     .0618389    .1103512
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.1361745    .1103512
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. 
. reg college_grad sport if male, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4196
                                                       F(  1,  1080) =  102.18
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0220
                                                       Root MSE      =  .47928

                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
college_grad |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       sport |   .1576754   .0155984    10.11   0.000     .1270688     .188282
       _cons |   .2652068   .0135947    19.51   0.000     .2385318    .2918818
------------------------------------------------------------------------------

. 
. reg college_grad sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priv
> ate urban2 urban3 urban4   if male, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4196
                                                       F( 32,  1080) =   88.09
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.3159
                                                       Root MSE      =  .40233

                              (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
--------------------------------------------------------------------------------
               |               Robust
  college_grad |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         sport |   .0946847   .0131485     7.20   0.000     .0688851    .1204842
          by73 |  -.0057272   .0288165    -0.20   0.842    -.0622699    .0508156
          by74 |   .0254369   .0286071     0.89   0.374    -.0306949    .0815687
          by75 |   .1266751   .0642204     1.97   0.049     .0006642    .2526861
   race_native |  -.1397586    .038175    -3.66   0.000    -.2146642   -.0648529
    race_black |   .0207351   .0259666     0.80   0.425    -.0302156    .0716859
     race_hisp |  -.0320151   .0201252    -1.59   0.112    -.0715039    .0074737
      race_api |   .0790423   .0291811     2.71   0.007     .0217843    .1363004
     hh_father |   .0640751   .0161702     3.96   0.000     .0323465    .0958037
     hh_mother |   .0795394   .0238017     3.34   0.001     .0328365    .1262422
     ed_mother |   .0636941    .020071     3.17   0.002     .0243116    .1030765
     ed_father |   .1466652     .01976     7.42   0.000     .1078928    .1854376
       inc_low |  -.0361447   .0160164    -2.26   0.024    -.0675715    -.004718
      inc_high |   .0954194   .0169969     5.61   0.000     .0620687    .1287702
      math_irt |   .0099832   .0008183    12.20   0.000     .0083776    .0115888
      read_irt |   .0042715   .0010699     3.99   0.000     .0021722    .0063709
     frqabsent |  -.1018364   .0255396    -3.99   0.000    -.1519493   -.0517235
      handicap |  -.0638982   .0405373    -1.58   0.115    -.1434389    .0156425
          enr2 |  -.0012716   .0247302    -0.05   0.959    -.0497962     .047253
          enr3 |   .0343262   .0267706     1.28   0.200    -.0182021    .0868546
          enr4 |   .0180967   .0269009     0.67   0.501    -.0346873    .0708807
          enr5 |  -.0278273   .0280401    -0.99   0.321    -.0828465    .0271919
          enr6 |  -.0000475    .026511    -0.00   0.999    -.0520663    .0519714
          enr7 |   -.009996   .0317964    -0.31   0.753    -.0723856    .0523937
          enr8 |  -.0117853   .0385146    -0.31   0.760    -.0873574    .0637867
          enr9 |  -.0007058   .0364896    -0.02   0.985    -.0723044    .0708928
 cont_catholic |   .1480247   .0329455     4.49   0.000     .0833802    .2126692
cont_religious |   .0617346   .0517368     1.19   0.233    -.0397814    .1632505
  cont_private |   .1529711   .0355992     4.30   0.000     .0831197    .2228225
        urban2 |  -.0234637   .0193129    -1.21   0.225    -.0613588    .0144313
        urban3 |  -.0320804   .0230619    -1.39   0.164    -.0773316    .0131707
        urban4 |  -.1415597   .2095232    -0.68   0.499    -.5526784     .269559
         _cons |  -.4213163   .0508022    -8.29   0.000    -.5209986    -.321634
--------------------------------------------------------------------------------

. 
. rcr college_grad sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priv
> ate urban2 urban3 urban4   if male, clust(F1SCH_ID) lambda(-1 0)
(68 missing values generated)
(68 missing values generated)


RCR model                                             Number of obs =     4196
                                             Lower bound on lambda  =       -1
                                             Upper bound on lambda  =        0


                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
college_grad |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.508165   .3273226    13.77   0.000     3.866624    5.149705
    betaxInf |   1.437871   .2016968     7.13   0.000     1.042552    1.833189
     lambda0 |   .8935982   .1822733     4.90   0.000     .5363491    1.250847
      betaxL |   .0946847   .0130983     7.23   0.000     .0690125    .1203568
      betaxH |   .1899764   .0191462     9.92   0.000     .1524505    .2275023
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)      .0690125    .2275023
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr college_grad sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priv
> ate urban2 urban3 urban4   if male, clust(F1SCH_ID) lambda(0 .5)
(68 missing values generated)
(68 missing values generated)


RCR model                                             Number of obs =     4196
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =       .5


                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
college_grad |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.508165   .3273226    13.77   0.000     3.866624    5.149705
    betaxInf |   1.437871   .2016968     7.13   0.000     1.042552    1.833189
     lambda0 |   .8935982   .1822733     4.90   0.000     .5363491    1.250847
      betaxL |   .0430646   .0158678     2.71   0.007     .0119643    .0741648
      betaxH |   .0946847   .0130983     7.23   0.000     .0690125    .1203568
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)      .0119643    .1203568
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr college_grad sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priv
> ate urban2 urban3 urban4   if male, clust(F1SCH_ID)
(68 missing values generated)
(68 missing values generated)


RCR model                                             Number of obs =     4196
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =        1


                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
college_grad |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.508165   .3273226    13.77   0.000     3.866624    5.149705
    betaxInf |   1.437871   .2016968     7.13   0.000     1.042552    1.833189
     lambda0 |   .8935982   .1822733     4.90   0.000     .5363491    1.250847
      betaxL |  -.0120721   .0220417    -0.55   0.584    -.0552731    .0311289
      betaxH |   .0946847   .0130983     7.23   0.000     .0690125    .1203568
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.0552731    .1203568
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. 
. preserve

. rcr college_grad sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priv
> ate urban2 urban3 urban4   if male, clust(F1SCH_ID) details
(68 missing values generated)
(68 missing values generated)


RCR model                                             Number of obs =     4196
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =        1


                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
college_grad |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.508165   .3273226    13.77   0.000     3.866624    5.149705
    betaxInf |   1.437871   .2016968     7.13   0.000     1.042552    1.833189
     lambda0 |   .8935982   .1822733     4.90   0.000     .5363491    1.250847
      betaxL |  -.0120721   .0220417    -0.55   0.584    -.0552731    .0311289
      betaxH |   .0946847   .0130983     7.23   0.000     .0690125    .1203568
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.0552731    .1203568
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. 
. rcrplot, xrange(-.5 2.05)

. 
. graph export NELSmaleColRCRplot.eps, replace
(file NELSmaleColRCRplot.eps written in EPS format)

. restore

. 
. 
. 
. /*  Attend post-secondary education */
. 
. reg post_second sport if female, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4742
                                                       F(  1,  1100) =   48.10
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0103
                                                       Root MSE      =  .32481

                            (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
 post_second |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       sport |   .0662994   .0095596     6.94   0.000     .0475422    .0850565
       _cons |    .845929   .0081795   103.42   0.000     .8298798    .8619783
------------------------------------------------------------------------------

. 
. reg post_second sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priva
> te urban2 urban3 urban4   if female, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4742
                                                       F( 32,  1100) =   17.29
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1272
                                                       Root MSE      =  .30602

                              (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
--------------------------------------------------------------------------------
               |               Robust
   post_second |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         sport |   .0347366   .0093037     3.73   0.000     .0164817    .0529915
          by73 |   .1186092   .0594643     1.99   0.046     .0019329    .2352855
          by74 |    .137798    .058628     2.35   0.019     .0227626    .2528334
          by75 |   .1465561   .0634451     2.31   0.021     .0220691    .2710432
   race_native |  -.0499187   .0645261    -0.77   0.439    -.1765268    .0766894
    race_black |   .0631988   .0174448     3.62   0.000     .0289701    .0974276
     race_hisp |   .0245706   .0176488     1.39   0.164    -.0100585    .0591997
      race_api |   .0377876   .0131116     2.88   0.004     .0120609    .0635143
     hh_father |   .0026208   .0122692     0.21   0.831    -.0214528    .0266944
     hh_mother |  -.0165809   .0213438    -0.78   0.437    -.0584601    .0252983
     ed_mother |   .0138039   .0090308     1.53   0.127    -.0039156    .0315234
     ed_father |   .0362665   .0089305     4.06   0.000     .0187438    .0537892
       inc_low |  -.0796145   .0153792    -5.18   0.000    -.1097903   -.0494387
      inc_high |   .0093553   .0095907     0.98   0.330    -.0094628    .0281734
      math_irt |   .0035235   .0005272     6.68   0.000     .0024891    .0045579
      read_irt |   .0046067   .0007655     6.02   0.000     .0031048    .0061086
     frqabsent |  -.0573978   .0236984    -2.42   0.016    -.1038969   -.0108986
      handicap |  -.1424151   .0544456    -2.62   0.009     -.249244   -.0355862
          enr2 |  -.0267223   .0212325    -1.26   0.208    -.0683832    .0149385
          enr3 |  -.0072801   .0195735    -0.37   0.710    -.0456857    .0311255
          enr4 |   .0126576   .0201965     0.63   0.531    -.0269705    .0522856
          enr5 |   .0059838   .0205926     0.29   0.771    -.0344214     .046389
          enr6 |  -.0060282   .0206461    -0.29   0.770    -.0465383    .0344819
          enr7 |    -.01357   .0215108    -0.63   0.528    -.0557769    .0286368
          enr8 |   .0500619   .0241668     2.07   0.039     .0026436    .0974802
          enr9 |   .0508198   .0233097     2.18   0.029     .0050833    .0965564
 cont_catholic |   .0444729   .0157135     2.83   0.005     .0136411    .0753046
cont_religious |   .0335267    .023689     1.42   0.157     -.012954    .0800074
  cont_private |  -.0022572   .0193789    -0.12   0.907    -.0402809    .0357665
        urban2 |  -.0152177   .0112585    -1.35   0.177    -.0373083    .0068729
        urban3 |   -.023857   .0152819    -1.56   0.119    -.0538419    .0061279
        urban4 |   .1046715   .0194201     5.39   0.000     .0665669    .1427762
         _cons |    .480765   .0669069     7.19   0.000     .3494855    .6120446
--------------------------------------------------------------------------------

. 
. rcr post_second sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priva
> te urban2 urban3 urban4   if female, clust(F1SCH_ID) lambda(-1 0)


RCR model                                             Number of obs =     4742
                                             Lower bound on lambda  =       -1
                                             Upper bound on lambda  =        0


                            (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
 post_second |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   3.432159   .2074197    16.55   0.000     3.025624    3.838694
    betaxInf |   .4380997   .0524501     8.35   0.000     .3352994    .5408999
     lambda0 |   .3523735   .1031025     3.42   0.001     .1502963    .5544506
      betaxL |   .0347366   .0092722     3.75   0.000     .0165634    .0529098
      betaxH |   .1134274   .0133089     8.52   0.000     .0873425    .1395123
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)      .0165634    .1395123
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr post_second sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priva
> te urban2 urban3 urban4   if female, clust(F1SCH_ID) lambda(0 .5)


RCR model                                             Number of obs =     4742
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =       .5


                            (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
 post_second |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   3.432159   .2074197    16.55   0.000     3.025624    3.838694
    betaxInf |   .4380997   .0524501     8.35   0.000     .3352994    .5408999
     lambda0 |   .3523735   .1031025     3.42   0.001     .1502963    .5544506
      betaxL |   -.015901   .0120652    -1.32   0.188    -.0395484    .0077464
      betaxH |   .0347366   .0092722     3.75   0.000     .0165634    .0529098
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.0395484    .0529098
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr post_second sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priva
> te urban2 urban3 urban4   if female, clust(F1SCH_ID)


RCR model                                             Number of obs =     4742
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =        1


                            (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
 post_second |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   3.432159   .2074197    16.55   0.000     3.025624    3.838694
    betaxInf |   .4380997   .0524501     8.35   0.000     .3352994    .5408999
     lambda0 |   .3523735   .1031025     3.42   0.001     .1502963    .5544506
      betaxL |  -.0768691   .0185909    -4.13   0.000    -.1133067   -.0404315
      betaxH |   .0347366   .0092722     3.75   0.000     .0165634    .0529098
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.1133067    .0529098
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. 
. reg post_second sport if male, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4227
                                                       F(  1,  1080) =   41.19
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0124
                                                       Root MSE      =  .36673

                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
 post_second |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       sport |    .090007   .0140238     6.42   0.000       .06249     .117524
       _cons |    .773934   .0129646    59.70   0.000     .7484953    .7993728
------------------------------------------------------------------------------

. 
. reg post_second sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priva
> te urban2 urban3 urban4   if male, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4227
                                                       F( 32,  1080) =   22.00
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1620
                                                       Root MSE      =  .33905

                              (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
--------------------------------------------------------------------------------
               |               Robust
   post_second |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         sport |   .0674671   .0129468     5.21   0.000     .0420633    .0928708
          by73 |   .1584498   .0450114     3.52   0.000     .0701301    .2467694
          by74 |   .1947445   .0444062     4.39   0.000     .1076122    .2818767
          by75 |   .1136641   .0698678     1.63   0.104    -.0234279    .2507561
   race_native |  -.0131744    .092852    -0.14   0.887    -.1953651    .1690163
    race_black |   .0604546   .0236342     2.56   0.011     .0140805    .1068287
     race_hisp |   .0899208   .0203594     4.42   0.000     .0499725    .1298692
      race_api |   .0664853   .0184465     3.60   0.000     .0302903    .1026803
     hh_father |   .0161101   .0149116     1.08   0.280    -.0131489     .045369
     hh_mother |   .0528435   .0265849     1.99   0.047     .0006795    .1050075
     ed_mother |   .0365418   .0114275     3.20   0.001     .0141192    .0589644
     ed_father |   .0444386   .0116424     3.82   0.000     .0215944    .0672828
       inc_low |  -.0682353   .0185486    -3.68   0.000    -.1046307   -.0318399
      inc_high |    .016968   .0118596     1.43   0.153    -.0063025    .0402386
      math_irt |   .0051111   .0006058     8.44   0.000     .0039225    .0062997
      read_irt |   .0036612   .0008102     4.52   0.000     .0020714     .005251
     frqabsent |  -.0759354   .0295466    -2.57   0.010    -.1339106   -.0179602
      handicap |  -.0021645   .0410608    -0.05   0.958    -.0827324    .0784035
          enr2 |  -.0244784   .0246408    -0.99   0.321    -.0728277    .0238709
          enr3 |  -.0147274   .0258731    -0.57   0.569    -.0654946    .0360398
          enr4 |   .0049586   .0259939     0.19   0.849    -.0460457    .0559629
          enr5 |    .011157   .0264137     0.42   0.673    -.0406709    .0629849
          enr6 |   .0081269   .0256287     0.32   0.751    -.0421608    .0584146
          enr7 |   .0354738   .0289208     1.23   0.220    -.0212735     .092221
          enr8 |   .0485102   .0323123     1.50   0.134    -.0148918    .1119122
          enr9 |   .0433992   .0330717     1.31   0.190    -.0214929    .1082912
 cont_catholic |    .098178   .0180204     5.45   0.000      .062819    .1335369
cont_religious |   .0176417   .0428627     0.41   0.681    -.0664619    .1017453
  cont_private |   .0259695   .0170147     1.53   0.127    -.0074161    .0593551
        urban2 |   .0115076   .0146623     0.78   0.433    -.0172623    .0402774
        urban3 |  -.0224115     .01934    -1.16   0.247    -.0603597    .0155367
        urban4 |   .0627387   .0711891     0.88   0.378    -.0769459    .2024233
         _cons |   .2046667   .0586001     3.49   0.000     .0896838    .3196496
--------------------------------------------------------------------------------

. 
. rcr post_second sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priva
> te urban2 urban3 urban4   if male, clust(F1SCH_ID) lambda(-1 0)


RCR model                                             Number of obs =     4227
                                             Lower bound on lambda  =       -1
                                             Upper bound on lambda  =        0


                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
 post_second |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.530593   .3284963    13.79   0.000     3.886752    5.174433
    betaxInf |   .5526676   .1213306     4.56   0.000      .314864    .7904713
     lambda0 |   1.074908    .298164     3.61   0.000     .4905168    1.659298
      betaxL |   .0674671   .0128977     5.23   0.000      .042188    .0927461
      betaxH |   .1180995   .0180663     6.54   0.000     .0826902    .1535089
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)       .042188    .1535089
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr post_second sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priva
> te urban2 urban3 urban4   if male, clust(F1SCH_ID) lambda(0 .5)


RCR model                                             Number of obs =     4227
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =       .5


                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
 post_second |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.530593   .3284963    13.79   0.000     3.886752    5.174433
    betaxInf |   .5526676   .1213306     4.56   0.000      .314864    .7904713
     lambda0 |   1.074908    .298164     3.61   0.000     .4905168    1.659298
      betaxL |   .0380652   .0147934     2.57   0.010     .0090707    .0670597
      betaxH |   .0674671   .0128977     5.23   0.000      .042188    .0927461
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)      .0090707    .0927461
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr post_second sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priva
> te urban2 urban3 urban4   if male, clust(F1SCH_ID)


RCR model                                             Number of obs =     4227
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =        1


                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
 post_second |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.530593   .3284963    13.79   0.000     3.886752    5.174433
    betaxInf |   .5526676   .1213306     4.56   0.000      .314864    .7904713
     lambda0 |   1.074908    .298164     3.61   0.000     .4905168    1.659298
      betaxL |   .0052526   .0200755     0.26   0.794    -.0340946    .0445998
      betaxH |   .0674671   .0128977     5.23   0.000      .042188    .0927461
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.0340946    .0927461
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. 
. 
. /*  Fitness Activity Analysis  */
. 
. reg fit_active sport if female, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4740
                                                       F(  1,  1100) =   67.24
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0134
                                                       Root MSE      =   .4876

                            (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
  fit_active |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       sport |   .1134213   .0138322     8.20   0.000     .0862808    .1405617
       _cons |   .5394572   .0104728    51.51   0.000     .5189083    .5600061
------------------------------------------------------------------------------

. 
. reg fit_active sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_privat
> e urban2 urban3 urban4   if female, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4740
                                                       F( 32,  1100) =    5.98
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0364
                                                       Root MSE      =  .48346

                              (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
--------------------------------------------------------------------------------
               |               Robust
    fit_active |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         sport |   .0934723   .0143574     6.51   0.000     .0653014    .1216432
          by73 |  -.0627057   .0664959    -0.94   0.346    -.1931788    .0677675
          by74 |  -.0189412   .0645394    -0.29   0.769    -.1455753     .107693
          by75 |  -.0869457   .0938574    -0.93   0.354    -.2711055     .097214
   race_native |  -.0155178   .0656493    -0.24   0.813    -.1443298    .1132942
    race_black |  -.1558709   .0277777    -5.61   0.000    -.2103742   -.1013676
     race_hisp |  -.0479159   .0245289    -1.95   0.051    -.0960445    .0002127
      race_api |  -.0866189   .0293635    -2.95   0.003    -.1442338   -.0290041
     hh_father |   .0183734   .0180815     1.02   0.310    -.0171048    .0538516
     hh_mother |   .0146312   .0332437     0.44   0.660    -.0505971    .0798595
     ed_mother |   .0201904   .0210933     0.96   0.339    -.0211973    .0615781
     ed_father |   .0378806   .0198469     1.91   0.057    -.0010613    .0768226
       inc_low |  -.0268772   .0197352    -1.36   0.174    -.0656001    .0118457
      inc_high |   .0136662   .0172355     0.79   0.428     -.020152    .0474844
      math_irt |   .0004527   .0008696     0.52   0.603    -.0012535    .0021589
      read_irt |   .0006862   .0011948     0.57   0.566    -.0016582    .0030306
     frqabsent |   .0067008   .0306318     0.22   0.827    -.0534025    .0668042
      handicap |  -.0802626   .0583831    -1.37   0.169    -.1948174    .0342921
          enr2 |   .0461981   .0284433     1.62   0.105    -.0096112    .1020074
          enr3 |   .0541106   .0309989     1.75   0.081    -.0067131    .1149343
          enr4 |   .0266668   .0305734     0.87   0.383    -.0333221    .0866556
          enr5 |   .0679525   .0290346     2.34   0.019     .0109831     .124922
          enr6 |   .0693692   .0297166     2.33   0.020     .0110616    .1276768
          enr7 |   .0397845    .033136     1.20   0.230    -.0252324    .1048015
          enr8 |   .0356275   .0381946     0.93   0.351     -.039315      .11057
          enr9 |   .0279727   .0358066     0.78   0.435    -.0422842    .0982296
 cont_catholic |    -.01747   .0330728    -0.53   0.597    -.0823629    .0474228
cont_religious |   .0006163   .0508081     0.01   0.990    -.0990755    .1003082
  cont_private |   .0247947   .0383925     0.65   0.519    -.0505361    .1001255
        urban2 |  -.0332637    .019578    -1.70   0.090    -.0716781    .0051507
        urban3 |  -.0289962     .02376    -1.22   0.223    -.0756161    .0176238
        urban4 |   .1970326   .1629645     1.21   0.227    -.1227239     .516789
         _cons |   .5070391   .0783998     6.47   0.000      .353209    .6608692
--------------------------------------------------------------------------------

. 
. rcr fit_active sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_privat
> e urban2 urban3 urban4   if female, clust(F1SCH_ID) lambda(-1 0)
(5 missing values generated)
(5 missing values generated)

 Warning: Inaccurate SE for thetaL/H. Try normalizing variables to mean zero.

 Warning: Inaccurate SE for thetaL/H. Try normalizing variables to mean zero.


RCR model                                             Number of obs =     4740
                                             Lower bound on lambda  =       -1
                                             Upper bound on lambda  =        0


                            (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
  fit_active |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |    3.43521   .2079858    16.52   0.000     3.027565    3.842855
    betaxInf |   .3488321   .0577644     6.04   0.000      .235616    .4620481
     lambda0 |   .5368171    .118678     4.52   0.000     .3042124    .7694217
      betaxL |   .3488321   119933.7     0.00   1.000    -235065.3      235066
      betaxH |   .3488321   119933.7     0.00   1.000    -235065.3      235066
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -235065.3      235066
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr fit_active sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_privat
> e urban2 urban3 urban4   if female, clust(F1SCH_ID) lambda(0 .5)
(5 missing values generated)
(5 missing values generated)

 Warning: Inaccurate SE for thetaL/H. Try normalizing variables to mean zero.

 Warning: Inaccurate SE for thetaL/H. Try normalizing variables to mean zero.


RCR model                                             Number of obs =     4740
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =       .5


                            (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
  fit_active |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |    3.43521   .2079858    16.52   0.000     3.027565    3.842855
    betaxInf |   .3488321   .0577644     6.04   0.000      .235616    .4620481
     lambda0 |   .5368171    .118678     4.52   0.000     .3042124    .7694217
      betaxL |   .3488321   119933.7     0.00   1.000    -235065.3      235066
      betaxH |   .3488321   119933.7     0.00   1.000    -235065.3      235066
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -235065.3      235066
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr fit_active sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_privat
> e urban2 urban3 urban4   if female, clust(F1SCH_ID)
(5 missing values generated)
(5 missing values generated)

 Warning: Inaccurate SE for thetaL/H. Try normalizing variables to mean zero.


RCR model                                             Number of obs =     4740
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =        1


                            (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
  fit_active |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |    3.43521   .2079858    16.52   0.000     3.027565    3.842855
    betaxInf |   .3488321   .0577644     6.04   0.000      .235616    .4620481
     lambda0 |   .5368171    .118678     4.52   0.000     .3042124    .7694217
      betaxL |          0   .0252683     0.00   1.000    -.0495249    .0495249
      betaxH |   .3488321   119933.7     0.00   1.000    -235065.3      235066
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.0495249      235066
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. 
. reg fit_active sport if male, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4224
                                                       F(  1,  1080) =  101.21
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0266
                                                       Root MSE      =  .47161

                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
  fit_active |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       sport |   .1710961   .0170068    10.06   0.000      .137726    .2044661
       _cons |   .5261886   .0141582    37.16   0.000     .4984079    .5539692
------------------------------------------------------------------------------

. 
. reg fit_active sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_privat
> e urban2 urban3 urban4   if male, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4224
                                                       F( 32,  1080) =    5.52
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0397
                                                       Root MSE      =  .47015

                              (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
--------------------------------------------------------------------------------
               |               Robust
    fit_active |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         sport |   .1751171    .016938    10.34   0.000      .141882    .2083522
          by73 |  -.0007199   .0431564    -0.02   0.987    -.0853997    .0839599
          by74 |   .0116657   .0417026     0.28   0.780    -.0701617    .0934931
          by75 |   .0713526   .0849082     0.84   0.401    -.0952512    .2379564
   race_native |  -.0060897   .0924706    -0.07   0.948    -.1875321    .1753528
    race_black |   .0076174   .0275548     0.28   0.782    -.0464497    .0616844
     race_hisp |   .0102926   .0277296     0.37   0.711    -.0441174    .0647026
      race_api |   .0269103   .0283681     0.95   0.343    -.0287526    .0825732
     hh_father |  -.0054459   .0190056    -0.29   0.775     -.042738    .0318463
     hh_mother |  -.0230639   .0281287    -0.82   0.412    -.0782569    .0321292
     ed_mother |   .0230756   .0193677     1.19   0.234     -.014927    .0610782
     ed_father |   .0534973    .019068     2.81   0.005     .0160828    .0909117
       inc_low |   .0285584   .0204878     1.39   0.164    -.0116419    .0687588
      inc_high |   .0179944   .0169462     1.06   0.289    -.0152568    .0512457
      math_irt |  -.0023523   .0008552    -2.75   0.006    -.0040304   -.0006743
      read_irt |   .0027772   .0011541     2.41   0.016     .0005126    .0050418
     frqabsent |  -.0052117   .0364868    -0.14   0.886    -.0768047    .0663813
      handicap |   .0610451   .0524652     1.16   0.245    -.0419001    .1639903
          enr2 |    .045444   .0309661     1.47   0.143    -.0153166    .1062046
          enr3 |   .0231033   .0315463     0.73   0.464    -.0387956    .0850022
          enr4 |    .087456   .0302996     2.89   0.004     .0280033    .1469088
          enr5 |   .0316677   .0313692     1.01   0.313    -.0298837    .0932191
          enr6 |    .085886   .0303432     2.83   0.005     .0263478    .1454242
          enr7 |   .1006912   .0347249     2.90   0.004     .0325553     .168827
          enr8 |   .0974732   .0386931     2.52   0.012     .0215511    .1733954
          enr9 |   .0974211   .0415358     2.35   0.019     .0159212    .1789211
 cont_catholic |   .0337072   .0305054     1.10   0.269    -.0261493    .0935637
cont_religious |   -.009184   .0560889    -0.16   0.870    -.1192395    .1008715
  cont_private |  -.0251489   .0383005    -0.66   0.512    -.1003007    .0500028
        urban2 |  -.0034016   .0195306    -0.17   0.862    -.0417239    .0349207
        urban3 |   .0108831   .0239937     0.45   0.650    -.0361964    .0579626
        urban4 |   .0456048   .2121435     0.21   0.830    -.3706554    .4618649
         _cons |    .453716   .0634372     7.15   0.000     .3292418    .5781902
--------------------------------------------------------------------------------

. 
. rcr fit_active sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_privat
> e urban2 urban3 urban4   if male, clust(F1SCH_ID) lambda(-1 0)
(5 missing values generated)
(5 missing values generated)


RCR model                                             Number of obs =     4224
                                             Lower bound on lambda  =       -1
                                             Upper bound on lambda  =        0


                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
  fit_active |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.548003   .3312343    13.73   0.000     3.898796     5.19721
    betaxInf |    .087923   .0861128     1.02   0.307     -.080855     .256701
     lambda0 |   4.757543   4.626945     1.03   0.304    -4.311103    13.82619
      betaxL |   .1495137   .0291846     5.12   0.000      .092313    .2067144
      betaxH |   .1751171   .0168737    10.38   0.000     .1420453    .2081889
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)       .092313    .2081889
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr fit_active sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_privat
> e urban2 urban3 urban4   if male, clust(F1SCH_ID) lambda(0 .5)
(5 missing values generated)
(5 missing values generated)


RCR model                                             Number of obs =     4224
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =       .5


                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
  fit_active |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.548003   .3312343    13.73   0.000     3.898796     5.19721
    betaxInf |    .087923   .0861128     1.02   0.307     -.080855     .256701
     lambda0 |   4.757543   4.626945     1.03   0.304    -4.311103    13.82619
      betaxL |   .1751171   .0168737    10.38   0.000     .1420453    .2081889
      betaxH |   .1976192   .0284662     6.94   0.000     .1418265    .2534118
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)      .1420453    .2534118
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. 
. preserve

. rcr fit_active sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_privat
> e urban2 urban3 urban4   if male, clust(F1SCH_ID) details
(5 missing values generated)
(5 missing values generated)


RCR model                                             Number of obs =     4224
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =        1


                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
  fit_active |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.548003   .3312343    13.73   0.000     3.898796     5.19721
    betaxInf |    .087923   .0861128     1.02   0.307     -.080855     .256701
     lambda0 |   4.757543   4.626945     1.03   0.304    -4.311103    13.82619
      betaxL |   .1751171   .0168737    10.38   0.000     .1420453    .2081889
      betaxH |   .2344347    .058847     3.98   0.000     .1190966    .3497728
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)      .1420453    .3497728
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. 
. rcrplot, xrange(-.4 .4) yrange(-5 5)

. 
. graph export NELSmaleFitRCRplot.eps, replace
(file NELSmaleFitRCRplot.eps written in EPS format)

. restore

. 
. 
. /*  Binge Drinking Analysis  */
. 
. reg binge_drink sport if female, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4731
                                                       F(  1,  1097) =   24.04
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0053
                                                       Root MSE      =  .36573

                            (Std. Err. adjusted for 1098 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
 binge_drink |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       sport |   .0531885    .010848     4.90   0.000     .0319033    .0744738
       _cons |   .1337234    .007169    18.65   0.000     .1196568    .1477899
------------------------------------------------------------------------------

. 
. reg binge_drink sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priva
> te urban2 urban3 urban4   if female, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4731
                                                       F( 32,  1097) =    4.22
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0233
                                                       Root MSE      =  .36358

                              (Std. Err. adjusted for 1098 clusters in F1SCH_ID)
--------------------------------------------------------------------------------
               |               Robust
   binge_drink |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         sport |    .043236   .0112091     3.86   0.000     .0212422    .0652298
          by73 |   .0304908   .0351875     0.87   0.386    -.0385516    .0995333
          by74 |   .0576449   .0347559     1.66   0.097    -.0105506    .1258404
          by75 |   .1129887   .0656013     1.72   0.085    -.0157295    .2417068
   race_native |  -.0200947   .0514623    -0.39   0.696    -.1210704    .0808809
    race_black |  -.1101946   .0151872    -7.26   0.000    -.1399937   -.0803955
     race_hisp |  -.0305566   .0195911    -1.56   0.119    -.0689969    .0078838
      race_api |  -.0942594   .0192747    -4.89   0.000     -.132079   -.0564399
     hh_father |  -.0030634     .01286    -0.24   0.812    -.0282963    .0221695
     hh_mother |  -.0020911   .0237935    -0.09   0.930    -.0487771    .0445949
     ed_mother |   .0178033   .0160701     1.11   0.268    -.0137282    .0493349
     ed_father |  -.0109882     .01472    -0.75   0.456    -.0398706    .0178943
       inc_low |  -.0092255   .0142478    -0.65   0.517    -.0371814    .0187305
      inc_high |   .0162291   .0138477     1.17   0.241    -.0109419    .0434001
      math_irt |   .0009447    .000643     1.47   0.142     -.000317    .0022064
      read_irt |  -.0011154    .000913    -1.22   0.222    -.0029068     .000676
     frqabsent |  -.0258297   .0222682    -1.16   0.246    -.0695227    .0178632
      handicap |   .0043268   .0471995     0.09   0.927    -.0882848    .0969383
          enr2 |   .0124651   .0235723     0.53   0.597    -.0337867     .058717
          enr3 |   .0183806   .0215891     0.85   0.395    -.0239799    .0607412
          enr4 |   .0101721   .0248303     0.41   0.682    -.0385482    .0588923
          enr5 |   .0128883   .0212596     0.61   0.544    -.0288259    .0546024
          enr6 |   .0220582    .021979     1.00   0.316    -.0210674    .0651839
          enr7 |   .0542482    .027147     2.00   0.046     .0009823    .1075142
          enr8 |   .0208754   .0279774     0.75   0.456    -.0340198    .0757707
          enr9 |    .016767   .0297552     0.56   0.573    -.0416166    .0751506
 cont_catholic |   .0441647   .0273482     1.61   0.107     -.009496    .0978254
cont_religious |  -.0535038   .0381842    -1.40   0.161    -.1284262    .0214186
  cont_private |   .0354838   .0372389     0.95   0.341    -.0375837    .1085512
        urban2 |  -.0132139   .0161701    -0.82   0.414    -.0449417    .0185139
        urban3 |  -.0150474   .0183085    -0.82   0.411    -.0509711    .0208763
        urban4 |  -.1211536   .0781417    -1.55   0.121    -.2744777    .0321704
         _cons |   .0953935   .0480948     1.98   0.048     .0010254    .1897616
--------------------------------------------------------------------------------

. 
. rcr binge_drink sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priva
> te urban2 urban3 urban4   if female, clust(F1SCH_ID) lambda(-1 0)
(25 missing values generated)
(25 missing values generated)

 Warning: Inaccurate SE for thetaL/H. Try normalizing variables to mean zero.

 Warning: Inaccurate SE for thetaL/H. Try normalizing variables to mean zero.


RCR model                                             Number of obs =     4731
                                             Lower bound on lambda  =       -1
                                             Upper bound on lambda  =        0


                            (Std. Err. adjusted for 1098 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
 binge_drink |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   3.438713   .2089818    16.45   0.000     3.029116     3.84831
    betaxInf |   .1708747   .0464679     3.68   0.000     .0797993    .2619501
     lambda0 |   .4287073   .1591095     2.69   0.007     .1168584    .7405562
      betaxL |   .1708747   843443.6     0.00   1.000     -1653119     1653119
      betaxH |   .1708747   843443.6     0.00   1.000     -1653119     1653119
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)      -1653119     1653119
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr binge_drink sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priva
> te urban2 urban3 urban4   if female, clust(F1SCH_ID) lambda(0 .5)
(25 missing values generated)
(25 missing values generated)

 Warning: Inaccurate SE for thetaL/H. Try normalizing variables to mean zero.


RCR model                                             Number of obs =     4731
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =       .5


                            (Std. Err. adjusted for 1098 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
 binge_drink |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   3.438713   .2089818    16.45   0.000     3.029116     3.84831
    betaxInf |   .1708747   .0464679     3.68   0.000     .0797993    .2619501
     lambda0 |   .4287073   .1591095     2.69   0.007     .1168584    .7405562
      betaxL |          0   .0201348     0.00   1.000    -.0394634    .0394634
      betaxH |   .1708747   33380.84     0.00   1.000    -65425.07    65425.41
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.0394634    65425.41
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr binge_drink sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priva
> te urban2 urban3 urban4   if female, clust(F1SCH_ID)
(25 missing values generated)
(25 missing values generated)

 Warning: Inaccurate SE for thetaL/H. Try normalizing variables to mean zero.


RCR model                                             Number of obs =     4731
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =        1


                            (Std. Err. adjusted for 1098 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
 binge_drink |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   3.438713   .2089818    16.45   0.000     3.029116     3.84831
    betaxInf |   .1708747   .0464679     3.68   0.000     .0797993    .2619501
     lambda0 |   .4287073   .1591095     2.69   0.007     .1168584    .7405562
      betaxL |          0   .0201348     0.00   1.000    -.0394634    .0394634
      betaxH |   .1708747   33380.84     0.00   1.000    -65425.07    65425.41
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.0394634    65425.41
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. 
. reg binge_drink sport if male, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4213
                                                       F(  1,  1080) =   55.27
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0125
                                                       Root MSE      =   .4858

                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
 binge_drink |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       sport |   .1197969   .0161143     7.43   0.000     .0881781    .1514157
       _cons |   .3099274   .0132802    23.34   0.000     .2838695    .3359853
------------------------------------------------------------------------------

. 
. reg binge_drink sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priva
> te urban2 urban3 urban4   if male, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4213
                                                       F( 32,  1080) =    5.80
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0397
                                                       Root MSE      =  .48082

                              (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
--------------------------------------------------------------------------------
               |               Robust
   binge_drink |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         sport |   .1073202   .0163225     6.57   0.000     .0752928    .1393477
          by73 |   .0602222   .0416383     1.45   0.148    -.0214789    .1419233
          by74 |   .0570892   .0409761     1.39   0.164    -.0233126    .1374909
          by75 |   .0550627   .0854617     0.64   0.520    -.1126271    .2227525
   race_native |  -.0153482   .0812179    -0.19   0.850    -.1747109    .1440145
    race_black |  -.1468609   .0282153    -5.21   0.000    -.2022238   -.0914979
     race_hisp |  -.0387982   .0274498    -1.41   0.158    -.0926591    .0150628
      race_api |  -.1169176   .0269322    -4.34   0.000    -.1697629   -.0640723
     hh_father |  -.0398829   .0197012    -2.02   0.043    -.0785398    -.001226
     hh_mother |   .0308406   .0302235     1.02   0.308    -.0284628    .0901439
     ed_mother |  -.0275912   .0212797    -1.30   0.195    -.0693454    .0141629
     ed_father |   .0136938   .0220703     0.62   0.535    -.0296117    .0569993
       inc_low |   -.060175    .022228    -2.71   0.007      -.10379     -.01656
      inc_high |   .0629493   .0182939     3.44   0.001     .0270536     .098845
      math_irt |   .0001298   .0008773     0.15   0.882    -.0015916    .0018512
      read_irt |  -.0016761   .0011773    -1.42   0.155    -.0039861     .000634
     frqabsent |  -.0095703   .0370755    -0.26   0.796    -.0823184    .0631778
      handicap |  -.1049432   .0491431    -2.14   0.033      -.20137   -.0085164
          enr2 |   .0303309   .0357877     0.85   0.397    -.0398904    .1005523
          enr3 |   .0135579   .0328054     0.41   0.679    -.0508117    .0779274
          enr4 |  -.0177232   .0315355    -0.56   0.574     -.079601    .0441546
          enr5 |  -.0169289   .0335674    -0.50   0.614    -.0827935    .0489357
          enr6 |  -.0465085    .031833    -1.46   0.144      -.10897    .0159531
          enr7 |  -.0155139   .0373205    -0.42   0.678    -.0887428    .0577151
          enr8 |  -.0219599   .0402816    -0.55   0.586     -.100999    .0570791
          enr9 |  -.0463969   .0374858    -1.24   0.216    -.1199501    .0271563
 cont_catholic |   .0511688   .0329034     1.56   0.120     -.013393    .1157306
cont_religious |  -.2019792    .044639    -4.52   0.000    -.2895682   -.1143902
  cont_private |  -.0182965   .0432257    -0.42   0.672    -.1031124    .0665194
        urban2 |    .002497   .0202086     0.12   0.902    -.0371556    .0421495
        urban3 |  -.0006335    .025915    -0.02   0.981     -.051483     .050216
        urban4 |  -.0962428   .1284971    -0.75   0.454    -.3483751    .1558895
         _cons |   .3404825   .0646046     5.27   0.000     .2137178    .4672472
--------------------------------------------------------------------------------

. 
. rcr binge_drink sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priva
> te urban2 urban3 urban4   if male, clust(F1SCH_ID) lambda(-1 0)
(25 missing values generated)
(25 missing values generated)


RCR model                                             Number of obs =     4213
                                             Lower bound on lambda  =       -1
                                             Upper bound on lambda  =        0


                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
 binge_drink |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.537562   .3295553    13.77   0.000     3.891645    5.183479
    betaxInf |   .3766857   .1016401     3.71   0.000     .1774747    .5758967
     lambda0 |   1.035036   .3255703     3.18   0.001     .3969298    1.673142
      betaxL |   .1073202   .0162604     6.60   0.000     .0754504      .13919
      betaxH |   .1685811   .0262695     6.42   0.000     .1170938    .2200684
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)      .0754504    .2200684
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr binge_drink sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priva
> te urban2 urban3 urban4   if male, clust(F1SCH_ID) lambda(0 .5)
(25 missing values generated)
(25 missing values generated)


RCR model                                             Number of obs =     4213
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =       .5


                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
 binge_drink |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.537562   .3295553    13.77   0.000     3.891645    5.183479
    betaxInf |   .3766857   .1016401     3.71   0.000     .1774747    .5758967
     lambda0 |   1.035036   .3255703     3.18   0.001     .3969298    1.673142
      betaxL |   .0630231   .0252414     2.50   0.013     .0135509    .1124952
      betaxH |   .1073202   .0162604     6.60   0.000     .0754504      .13919
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)      .0135509      .13919
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr binge_drink sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_priva
> te urban2 urban3 urban4   if male, clust(F1SCH_ID)
(25 missing values generated)
(25 missing values generated)


RCR model                                             Number of obs =     4213
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =        1


                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
 binge_drink |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.537562   .3295553    13.77   0.000     3.891645    5.183479
    betaxInf |   .3766857   .1016401     3.71   0.000     .1774747    .5758967
     lambda0 |   1.035036   .3255703     3.18   0.001     .3969298    1.673142
      betaxL |   .0047375   .0429985     0.11   0.912    -.0795379     .089013
      betaxH |   .1073202   .0162604     6.60   0.000     .0754504      .13919
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.0795379      .13919
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. 
. /*   Income and work Analysis   */
. 
. reg workft sport if female, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4741
                                                       F(  1,  1100) =    4.12
                                                       Prob > F      =  0.0427
                                                       R-squared     =  0.0009
                                                       Root MSE      =  .44885

                            (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
      workft |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       sport |   .0266997    .013162     2.03   0.043     .0008743    .0525252
       _cons |   .7068894   .0098452    71.80   0.000     .6875719    .7262068
------------------------------------------------------------------------------

. 
. reg workft sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private ur
> ban2 urban3 urban4   if female, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4741
                                                       F( 32,  1100) =    3.16
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0209
                                                       Root MSE      =  .44578

                              (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
--------------------------------------------------------------------------------
               |               Robust
        workft |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         sport |   .0342071      .0133     2.57   0.010     .0081108    .0603033
          by73 |   .1695116   .0660072     2.57   0.010     .0399974    .2990259
          by74 |   .1901228   .0655209     2.90   0.004     .0615626    .3186829
          by75 |    .125768   .0906539     1.39   0.166     -.052106     .303642
   race_native |  -.0909368   .0629023    -1.45   0.149    -.2143589    .0324853
    race_black |   .0581226   .0235526     2.47   0.014     .0119094    .1043358
     race_hisp |  -.0418886   .0226115    -1.85   0.064    -.0862552     .002478
      race_api |  -.0615329   .0271005    -2.27   0.023    -.1147075   -.0083584
     hh_father |   .0380231   .0165664     2.30   0.022     .0055177    .0705285
     hh_mother |   .0770715   .0323966     2.38   0.018     .0135053    .1406376
     ed_mother |   .0187345    .020004     0.94   0.349    -.0205158    .0579847
     ed_father |  -.0263655   .0185721    -1.42   0.156    -.0628062    .0100753
       inc_low |   .0071939   .0182689     0.39   0.694    -.0286518    .0430397
      inc_high |  -.0007105   .0163694    -0.04   0.965    -.0328292    .0314082
      math_irt |  -.0001385   .0008556    -0.16   0.871    -.0018173    .0015403
      read_irt |   .0010868   .0011299     0.96   0.336    -.0011302    .0033038
     frqabsent |  -.0599857   .0286135    -2.10   0.036    -.1161289   -.0038424
      handicap |  -.0758676   .0622915    -1.22   0.224    -.1980913     .046356
          enr2 |  -.0158441    .029228    -0.54   0.588     -.073193    .0415049
          enr3 |   .0324944   .0275502     1.18   0.238    -.0215624    .0865512
          enr4 |     .04212   .0293027     1.44   0.151    -.0153756    .0996156
          enr5 |   .0444098   .0270965     1.64   0.102    -.0087569    .0975765
          enr6 |   .0775209   .0264953     2.93   0.004     .0255338     .129508
          enr7 |   .0522381    .031089     1.68   0.093    -.0087623    .1132386
          enr8 |   .0330287    .035071     0.94   0.347     -.035785    .1018423
          enr9 |   .0263422   .0370925     0.71   0.478    -.0464377    .0991222
 cont_catholic |   .0498642    .030794     1.62   0.106    -.0105574    .1102858
cont_religious |  -.1000236    .044041    -2.27   0.023    -.1864374   -.0136098
  cont_private |   -.081557   .0447132    -1.82   0.068    -.1692898    .0061757
        urban2 |  -.0274417   .0187442    -1.46   0.143    -.0642201    .0093367
        urban3 |  -.0022372   .0210643    -0.11   0.915    -.0435679    .0390935
        urban4 |  -.1349384   .1183312    -1.14   0.254    -.3671187     .097242
         _cons |   .3846752   .0846863     4.54   0.000     .2185103      .55084
--------------------------------------------------------------------------------

. 
. rcr workft sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private ur
> ban2 urban3 urban4   if female, clust(F1SCH_ID) lambda(-1 0)
(1 missing value generated)
(1 missing value generated)


RCR model                                             Number of obs =     4741
                                             Lower bound on lambda  =       -1
                                             Upper bound on lambda  =        0


                            (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
      workft |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   3.433727   .2076705    16.53   0.000     3.026701    3.840754
    betaxInf |  -.0618152   .0564819    -1.09   0.274    -.1725177    .0488873
     lambda0 |  -.9226983   .9186791    -1.00   0.315    -2.723276    .8778797
      betaxL |  -.0018053   .0229748    -0.08   0.937     -.046835    .0432244
      betaxH |   .0342071   .0132551     2.58   0.010     .0082276    .0601865
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)      -.046835    .0601865
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr workft sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private ur
> ban2 urban3 urban4   if female, clust(F1SCH_ID) lambda(0 .5)
(1 missing value generated)
(1 missing value generated)


RCR model                                             Number of obs =     4741
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =       .5


                            (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
      workft |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   3.433727   .2076705    16.53   0.000     3.026701    3.840754
    betaxInf |  -.0618152   .0564819    -1.09   0.274    -.1725177    .0488873
     lambda0 |  -.9226983   .9186791    -1.00   0.315    -2.723276    .8778797
      betaxL |   .0342071   .0132551     2.58   0.010     .0082276    .0601865
      betaxH |   .0733804   .0274432     2.67   0.007     .0195928     .127168
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)      .0082276     .127168
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr workft sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private ur
> ban2 urban3 urban4   if female, clust(F1SCH_ID)
(1 missing value generated)
(1 missing value generated)


RCR model                                             Number of obs =     4741
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =        1


                            (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
      workft |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   3.433727   .2076705    16.53   0.000     3.026701    3.840754
    betaxInf |  -.0618152   .0564819    -1.09   0.274    -.1725177    .0488873
     lambda0 |  -.9226983   .9186791    -1.00   0.315    -2.723276    .8778797
      betaxL |   .0342071   .0132551     2.58   0.010     .0082276    .0601865
      betaxH |   .1515892   .0589232     2.57   0.010     .0361018    .2670765
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)      .0082276    .2670765
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. 
. reg workft sport if male, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4227
                                                       F(  1,  1080) =    0.33
                                                       Prob > F      =  0.5632
                                                       R-squared     =  0.0001
                                                       Root MSE      =  .36283

                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
      workft |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       sport |   .0070807    .012246     0.58   0.563     -.016948    .0311093
       _cons |    .839099   .0105869    79.26   0.000     .8183256    .8598723
------------------------------------------------------------------------------

. 
. reg workft sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private ur
> ban2 urban3 urban4   if male, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4227
                                                       F( 32,  1080) =    4.64
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0349
                                                       Root MSE      =  .35778

                              (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
--------------------------------------------------------------------------------
               |               Robust
        workft |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         sport |   .0133476   .0123491     1.08   0.280    -.0108832    .0375785
          by73 |  -.0586932   .0268639    -2.18   0.029    -.1114046   -.0059818
          by74 |  -.0519611   .0263819    -1.97   0.049    -.1037267   -.0001956
          by75 |    .054396     .05641     0.96   0.335    -.0562896    .1650816
   race_native |  -.0703733   .0721845    -0.97   0.330    -.2120111    .0712645
    race_black |   -.079724   .0242431    -3.29   0.001    -.1272929    -.032155
     race_hisp |  -.0419045   .0193587    -2.16   0.031    -.0798894   -.0039195
      race_api |  -.0936167   .0253974    -3.69   0.000    -.1434505   -.0437828
     hh_father |   .0344992   .0148903     2.32   0.021      .005282    .0637164
     hh_mother |   .0270873   .0246232     1.10   0.272    -.0212274     .075402
     ed_mother |  -.0056948   .0160973    -0.35   0.724    -.0372804    .0258909
     ed_father |  -.0291804   .0156177    -1.87   0.062    -.0598248     .001464
       inc_low |  -.0130049   .0159299    -0.82   0.414     -.044262    .0182522
      inc_high |  -.0275037   .0150037    -1.83   0.067    -.0569434     .001936
      math_irt |  -.0017475   .0006713    -2.60   0.009    -.0030647   -.0004302
      read_irt |  -.0017241   .0009196    -1.87   0.061    -.0035284    .0000802
     frqabsent |  -.0290372   .0272835    -1.06   0.287    -.0825719    .0244975
      handicap |   .0092325   .0386809     0.24   0.811    -.0666657    .0851307
          enr2 |  -.0275891   .0201811    -1.37   0.172    -.0671877    .0120096
          enr3 |  -.0495518   .0210359    -2.36   0.019    -.0908277   -.0082759
          enr4 |   -.040518   .0205699    -1.97   0.049    -.0808794   -.0001565
          enr5 |    -.03689   .0208264    -1.77   0.077    -.0777548    .0039747
          enr6 |  -.0513298   .0197714    -2.60   0.010    -.0901246    -.012535
          enr7 |  -.0425374   .0243505    -1.75   0.081    -.0903171    .0052423
          enr8 |  -.0521508   .0289021    -1.80   0.071    -.1088613    .0045597
          enr9 |  -.0324379   .0271078    -1.20   0.232    -.0856277     .020752
 cont_catholic |   .0048686   .0246938     0.20   0.844    -.0435847    .0533219
cont_religious |  -.0866959   .0482592    -1.80   0.073    -.1813882    .0079965
  cont_private |  -.0424685   .0324776    -1.31   0.191    -.1061949    .0212579
        urban2 |   .0420418   .0156572     2.69   0.007     .0113197    .0727638
        urban3 |   .0413835   .0179758     2.30   0.022     .0061121    .0766549
        urban4 |  -.0122368   .0693794    -0.18   0.860    -.1483706    .1238969
         _cons |   .9996896   .0441145    22.66   0.000     .9131298    1.086249
--------------------------------------------------------------------------------

. 
. rcr workft sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private ur
> ban2 urban3 urban4   if male, clust(F1SCH_ID) lambda(-1 0)
(1 missing value generated)
(1 missing value generated)


RCR model                                             Number of obs =     4227
                                             Lower bound on lambda  =       -1
                                             Upper bound on lambda  =        0


                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
      workft |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.530593   .3284963    13.79   0.000     3.886752    5.174433
    betaxInf |  -.1215566   .0767699    -1.58   0.113    -.2720228    .0289097
     lambda0 |   -.426613   .4738737    -0.90   0.368    -1.355388    .5021623
      betaxL |  -.0143543    .018484    -0.78   0.437    -.0505824    .0218737
      betaxH |   .0133476   .0123022     1.08   0.278    -.0107643    .0374595
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.0505824    .0374595
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr workft sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private ur
> ban2 urban3 urban4   if male, clust(F1SCH_ID) lambda(0 .5)
(1 missing value generated)
(1 missing value generated)


RCR model                                             Number of obs =     4227
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =       .5


                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
      workft |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.530593   .3284963    13.79   0.000     3.886752    5.174433
    betaxInf |  -.1215566   .0767699    -1.58   0.113    -.2720228    .0289097
     lambda0 |   -.426613   .4738737    -0.90   0.368    -1.355388    .5021623
      betaxL |   .0133476   .0123022     1.08   0.278    -.0107643    .0374595
      betaxH |   .0330594   .0178687     1.85   0.064    -.0019625    .0680814
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.0107643    .0680814
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr workft sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private ur
> ban2 urban3 urban4   if male, clust(F1SCH_ID)
(1 missing value generated)
(1 missing value generated)


RCR model                                             Number of obs =     4227
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =        1


                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
      workft |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.530593   .3284963    13.79   0.000     3.886752    5.174433
    betaxInf |  -.1215566   .0767699    -1.58   0.113    -.2720228    .0289097
     lambda0 |   -.426613   .4738737    -0.90   0.368    -1.355388    .5021623
      betaxL |   .0133476   .0123022     1.08   0.278    -.0107643    .0374595
      betaxH |   .0590464   .0300639     1.96   0.050     .0001222    .1179706
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.0107643    .1179706
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. 
. gen loginc = log(inc99)
(1033 missing values generated)

. 
. reg loginc sport if female, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4072
                                                       F(  1,  1061) =   29.32
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0065
                                                       Root MSE      =  .80147

                            (Std. Err. adjusted for 1062 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
      loginc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       sport |   .1300445    .024017     5.41   0.000     .0829182    .1771707
       _cons |   9.765541   .0184326   529.80   0.000     9.729373     9.80171
------------------------------------------------------------------------------

. 
. reg loginc sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private ur
> ban2 urban3 urban4   if female, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4072
                                                       F( 32,  1061) =    8.61
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0600
                                                       Root MSE      =  .78259

                              (Std. Err. adjusted for 1062 clusters in F1SCH_ID)
--------------------------------------------------------------------------------
               |               Robust
        loginc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         sport |   .0834899   .0242011     3.45   0.001     .0360025    .1309773
          by73 |   .2965535   .1697489     1.75   0.081    -.0365283    .6296353
          by74 |   .3401106   .1674523     2.03   0.042     .0115353    .6686859
          by75 |   .3489995   .2035395     1.71   0.087    -.0503863    .7483852
   race_native |  -.3913425   .1747716    -2.24   0.025    -.7342798   -.0484053
    race_black |   .1047294   .0483389     2.17   0.030     .0098787    .1995801
     race_hisp |   .0254924   .0426336     0.60   0.550    -.0581634    .1091482
      race_api |   .0221078   .0542796     0.41   0.684    -.0843999    .1286154
     hh_father |   .0649193   .0315003     2.06   0.040     .0031093    .1267294
     hh_mother |   -.042959   .0482845    -0.89   0.374    -.1377029     .051785
     ed_mother |  -.0201113   .0373678    -0.54   0.591    -.0934345    .0532119
     ed_father |   .0507546   .0345842     1.47   0.143    -.0171066    .1186159
       inc_low |  -.1157058     .03548    -3.26   0.001    -.1853247   -.0460868
      inc_high |   .0225134   .0332099     0.68   0.498    -.0426511    .0876779
      math_irt |   .0078075   .0015237     5.12   0.000     .0048176    .0107974
      read_irt |   .0025486   .0019723     1.29   0.197    -.0013214    .0064187
     frqabsent |  -.0777032   .0551956    -1.41   0.159     -.186008    .0306017
      handicap |   -.007713     .09624    -0.08   0.936    -.1965553    .1811294
          enr2 |  -.0396929   .0506976    -0.78   0.434    -.1391719    .0597861
          enr3 |    .096543   .0462947     2.09   0.037     .0057034    .1873826
          enr4 |   .0732417   .0520378     1.41   0.160    -.0288671    .1753504
          enr5 |   .0240194   .0545645     0.44   0.660    -.0830472     .131086
          enr6 |   .0932324   .0518638     1.80   0.073    -.0085348    .1949996
          enr7 |   .0460913    .056843     0.81   0.418    -.0654462    .1576288
          enr8 |  -.0398209    .068665    -0.58   0.562    -.1745556    .0949138
          enr9 |   .1541026   .0702001     2.20   0.028     .0163559    .2918494
 cont_catholic |   .2089826   .0543896     3.84   0.000     .1022592    .3157059
cont_religious |  -.0723593   .0952812    -0.76   0.448    -.2593203    .1146016
  cont_private |  -.0009796   .0686869    -0.01   0.989    -.1357572     .133798
        urban2 |   .0364822   .0356253     1.02   0.306    -.0334218    .1063862
        urban3 |  -.0302192   .0406157    -0.74   0.457    -.1099154    .0494769
        urban4 |   .4614045   .1412109     3.27   0.001       .18432    .7384889
         _cons |   9.021244   .1910867    47.21   0.000     8.646293    9.396195
--------------------------------------------------------------------------------

. 
. rcr loginc sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private ur
> ban2 urban3 urban4   if female, clust(F1SCH_ID) lambda(-1 0)
(1033 missing values generated)
(1033 missing values generated)


RCR model                                             Number of obs =     4072
                                             Lower bound on lambda  =       -1
                                             Upper bound on lambda  =        0


                            (Std. Err. adjusted for 1062 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
      loginc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   3.320491   .2038701    16.29   0.000     2.920913    3.720069
    betaxInf |     .64334   .1124048     5.72   0.000     .4230307    .8636493
     lambda0 |   .3534782   .1208765     2.92   0.003     .1165646    .5903918
      betaxL |   .0834899   .0241058     3.46   0.001     .0362434    .1307363
      betaxH |   .2427794   .0365599     6.64   0.000     .1711233    .3144356
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)      .0362434    .3144356
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr loginc sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private ur
> ban2 urban3 urban4   if female, clust(F1SCH_ID) lambda(0 .5)
(1033 missing values generated)
(1033 missing values generated)


RCR model                                             Number of obs =     4072
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =       .5


                            (Std. Err. adjusted for 1062 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
      loginc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   3.320491   .2038701    16.29   0.000     2.920913    3.720069
    betaxInf |     .64334   .1124048     5.72   0.000     .4230307    .8636493
     lambda0 |   .3534782   .1208765     2.92   0.003     .1165646    .5903918
      betaxL |  -.0403748   .0374039    -1.08   0.280     -.113685    .0329354
      betaxH |   .0834899   .0241058     3.46   0.001     .0362434    .1307363
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)      -.113685    .1307363
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr loginc sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private ur
> ban2 urban3 urban4   if female, clust(F1SCH_ID)
(1033 missing values generated)
(1033 missing values generated)


RCR model                                             Number of obs =     4072
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =        1


                            (Std. Err. adjusted for 1062 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
      loginc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   3.320491   .2038701    16.29   0.000     2.920913    3.720069
    betaxInf |     .64334   .1124048     5.72   0.000     .4230307    .8636493
     lambda0 |   .3534782   .1208765     2.92   0.003     .1165646    .5903918
      betaxL |  -.2096109   .0641349    -3.27   0.001    -.3353129   -.0839089
      betaxH |   .0834899   .0241058     3.46   0.001     .0362434    .1307363
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.3353129    .1307363
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. 
. reg loginc sport if male, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    3864
                                                       F(  1,  1062) =   31.32
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0081
                                                       Root MSE      =  .69708

                            (Std. Err. adjusted for 1063 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
      loginc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       sport |   .1382677   .0247055     5.60   0.000     .0897905     .186745
       _cons |   10.07127   .0212406   474.15   0.000     10.02959    10.11294
------------------------------------------------------------------------------

. 
. reg loginc sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private ur
> ban2 urban3 urban4   if male, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    3864
                                                       F( 32,  1062) =    4.77
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0322
                                                       Root MSE      =  .69138

                              (Std. Err. adjusted for 1063 clusters in F1SCH_ID)
--------------------------------------------------------------------------------
               |               Robust
        loginc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         sport |   .1280959   .0250767     5.11   0.000     .0788905    .1773014
          by73 |  -.0093614   .0654671    -0.14   0.886    -.1378211    .1190982
          by74 |  -.0052022   .0639722    -0.08   0.935    -.1307284     .120324
          by75 |   .1877442   .1205405     1.56   0.120    -.0487804    .4242688
   race_native |  -.2602015   .1317942    -1.97   0.049    -.5188081    -.001595
    race_black |  -.1185508    .039337    -3.01   0.003     -.195738   -.0413636
     race_hisp |  -.1478054   .0437329    -3.38   0.001    -.2336181   -.0619928
      race_api |  -.0077193    .061667    -0.13   0.900    -.1287224    .1132838
     hh_father |   .0858136   .0285531     3.01   0.003     .0297868    .1418404
     hh_mother |   -.008436   .0441212    -0.19   0.848    -.0950107    .0781387
     ed_mother |   .0503624   .0328856     1.53   0.126    -.0141658    .1148906
     ed_father |  -.0427124   .0335076    -1.27   0.203    -.1084611    .0230362
       inc_low |  -.0564989   .0293712    -1.92   0.055    -.1141311    .0011333
      inc_high |   .0295165   .0282221     1.05   0.296     -.025861    .0848939
      math_irt |   .0032633   .0013879     2.35   0.019     .0005399    .0059866
      read_irt |  -.0057215   .0018092    -3.16   0.002    -.0092715   -.0021714
     frqabsent |  -.0779211   .0509121    -1.53   0.126    -.1778209    .0219787
      handicap |   .0092012   .0765471     0.12   0.904    -.1409995     .159402
          enr2 |   .0196946   .0417594     0.47   0.637    -.0622457    .1016349
          enr3 |    .012688    .046531     0.27   0.785    -.0786151    .1039911
          enr4 |   .0366826   .0439239     0.84   0.404    -.0495049    .1228701
          enr5 |   .0297958   .0411062     0.72   0.469    -.0508628    .1104545
          enr6 |  -.0361766    .044862    -0.81   0.420    -.1242049    .0518517
          enr7 |   -.014674    .050965    -0.29   0.773    -.1146777    .0853296
          enr8 |   .0761181    .063248     1.20   0.229    -.0479872    .2002233
          enr9 |   .0883507   .0648717     1.36   0.174    -.0389406     .215642
 cont_catholic |   .0980212   .0487209     2.01   0.044     .0024211    .1936213
cont_religious |   .0690902   .1020294     0.68   0.498    -.1311119    .2692923
  cont_private |  -.0072495   .0628593    -0.12   0.908    -.1305921    .1160931
        urban2 |   .0401077   .0325742     1.23   0.218    -.0238093    .1040247
        urban3 |    .084221   .0360161     2.34   0.020     .0135503    .1548918
        urban4 |  -.4039549   .1568016    -2.58   0.010    -.7116311   -.0962787
         _cons |    10.0194   .1034529    96.85   0.000     9.816401    10.22239
--------------------------------------------------------------------------------

. 
. rcr loginc sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private ur
> ban2 urban3 urban4   if male, clust(F1SCH_ID) lambda(-1 0)
(1033 missing values generated)
(1033 missing values generated)


RCR model                                             Number of obs =     3864
                                             Lower bound on lambda  =       -1
                                             Upper bound on lambda  =        0


                            (Std. Err. adjusted for 1063 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
      loginc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.559064   .3423923    13.32   0.000     3.887988    5.230141
    betaxInf |   .3496895   .1444189     2.42   0.015     .0666337    .6327454
     lambda0 |   1.231176    .548272     2.25   0.025     .1565826    2.305769
      betaxL |   .1280959   .0249726     5.13   0.000     .0791506    .1770413
      betaxH |   .1802684   .0389103     4.63   0.000     .1040057    .2565312
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)      .0791506    .2565312
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr loginc sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private ur
> ban2 urban3 urban4   if male, clust(F1SCH_ID) lambda(0 .5)
(1033 missing values generated)
(1033 missing values generated)


RCR model                                             Number of obs =     3864
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =       .5


                            (Std. Err. adjusted for 1063 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
      loginc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.559064   .3423923    13.32   0.000     3.887988    5.230141
    betaxInf |   .3496895   .1444189     2.42   0.015     .0666337    .6327454
     lambda0 |   1.231176    .548272     2.25   0.025     .1565826    2.305769
      betaxL |    .088536   .0383611     2.31   0.021     .0133496    .1637223
      betaxH |   .1280959   .0249726     5.13   0.000     .0791506    .1770413
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)      .0133496    .1770413
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr loginc sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private ur
> ban2 urban3 urban4   if male, clust(F1SCH_ID)
(1033 missing values generated)
(1033 missing values generated)


RCR model                                             Number of obs =     3864
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =        1


                            (Std. Err. adjusted for 1063 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
      loginc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.559064   .3423923    13.32   0.000     3.887988    5.230141
    betaxInf |   .3496895   .1444189     2.42   0.015     .0666337    .6327454
     lambda0 |   1.231176    .548272     2.25   0.025     .1565826    2.305769
      betaxL |   .0332939   .0679314     0.49   0.624    -.0998491    .1664369
      betaxH |   .1280959   .0249726     5.13   0.000     .0791506    .1770413
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.0998491    .1770413
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. 
. /*  Voter Analysis  */
. 
. reg voter sport if female, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4742
                                                       F(  1,  1100) =   12.29
                                                       Prob > F      =  0.0005
                                                       R-squared     =  0.0026
                                                       Root MSE      =  .45128

                            (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
       voter |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       sport |   .0460968   .0131512     3.51   0.000     .0202925    .0719011
       _cons |   .6914405     .00996    69.42   0.000     .6718978    .7109832
------------------------------------------------------------------------------

. 
. reg voter sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private urb
> an2 urban3 urban4   if female, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4742
                                                       F( 32,  1100) =   10.28
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0567
                                                       Root MSE      =  .44031

                              (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
--------------------------------------------------------------------------------
               |               Robust
         voter |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         sport |   .0108285   .0134595     0.80   0.421    -.0155806    .0372377
          by73 |  -.0432879   .0596844    -0.73   0.468    -.1603961    .0738203
          by74 |   -.045793   .0592077    -0.77   0.439    -.1619658    .0703798
          by75 |  -.2359021   .0883492    -2.67   0.008    -.4092541   -.0625501
   race_native |  -.0648774   .0589802    -1.10   0.272    -.1806038    .0508489
    race_black |   .0491059   .0261807     1.88   0.061     -.002264    .1004757
     race_hisp |  -.0332061   .0248639    -1.34   0.182     -.081992    .0155799
      race_api |   -.210136   .0279943    -7.51   0.000    -.2650641   -.1552078
     hh_father |   .0273829   .0167011     1.64   0.101    -.0053868    .0601526
     hh_mother |    .013846   .0313887     0.44   0.659    -.0477425    .0754346
     ed_mother |   .0216335   .0179858     1.20   0.229    -.0136568    .0569238
     ed_father |   .0718883    .017039     4.22   0.000     .0384558    .1053209
       inc_low |  -.0241987   .0186463    -1.30   0.195     -.060785    .0123876
      inc_high |  -.0007733   .0158596    -0.05   0.961    -.0318918    .0303453
      math_irt |   .0014757   .0008134     1.81   0.070    -.0001203    .0030718
      read_irt |   .0052952   .0011086     4.78   0.000     .0031199    .0074704
     frqabsent |  -.0206008   .0297747    -0.69   0.489    -.0790224    .0378208
      handicap |   .0395184   .0540711     0.73   0.465    -.0665758    .1456126
          enr2 |   -.007408   .0265662    -0.28   0.780    -.0595342    .0447182
          enr3 |   -.050831   .0294316    -1.73   0.084    -.1085795    .0069174
          enr4 |  -.0429596   .0302209    -1.42   0.155    -.1022568    .0163375
          enr5 |  -.0515976   .0277458    -1.86   0.063    -.1060382    .0028431
          enr6 |  -.0086704   .0283722    -0.31   0.760    -.0643401    .0469992
          enr7 |  -.0028446   .0312064    -0.09   0.927    -.0640753    .0583861
          enr8 |  -.0519419   .0346204    -1.50   0.134    -.1198713    .0159876
          enr9 |  -.0573148      .0369    -1.55   0.121     -.129717    .0150875
 cont_catholic |   .0189313   .0291842     0.65   0.517    -.0383316    .0761942
cont_religious |   -.006063   .0515827    -0.12   0.906    -.1072747    .0951486
  cont_private |   .0509405   .0339294     1.50   0.134    -.0156333    .1175142
        urban2 |   .0053882   .0179556     0.30   0.764    -.0298429    .0406193
        urban3 |   .0130181   .0212014     0.61   0.539    -.0285817     .054618
        urban4 |  -.0516574   .1559805    -0.33   0.741    -.3577103    .2543954
         _cons |   .5260466   .0751408     7.00   0.000      .378611    .6734821
--------------------------------------------------------------------------------

. 
. rcr voter sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private urb
> an2 urban3 urban4   if female, clust(F1SCH_ID) lambda(-1 0)


RCR model                                             Number of obs =     4742
                                             Lower bound on lambda  =       -1
                                             Upper bound on lambda  =        0


                            (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
       voter |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   3.432159   .2074197    16.55   0.000     3.025624    3.838694
    betaxInf |    .461547   .0618128     7.47   0.000     .3403963    .5826978
     lambda0 |   .0676789   .0841758     0.80   0.421    -.0973027    .2326605
      betaxL |   .0108285    .013414     0.81   0.420    -.0154624    .0371194
      betaxH |   .1365532   .0197552     6.91   0.000     .0978337    .1752727
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.0154624    .1752727
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr voter sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private urb
> an2 urban3 urban4   if female, clust(F1SCH_ID) lambda(0 .5)


RCR model                                             Number of obs =     4742
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =       .5


                            (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
       voter |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   3.432159   .2074197    16.55   0.000     3.025624    3.838694
    betaxInf |    .461547   .0618128     7.47   0.000     .3403963    .5826978
     lambda0 |   .0676789   .0841758     0.80   0.421    -.0973027    .2326605
      betaxL |  -.0774054   .0181747    -4.26   0.000    -.1130272   -.0417837
      betaxH |   .0108285    .013414     0.81   0.420    -.0154624    .0371194
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.1130272    .0371194
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr voter sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private urb
> an2 urban3 urban4   if female, clust(F1SCH_ID)


RCR model                                             Number of obs =     4742
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =        1


                            (Std. Err. adjusted for 1101 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
       voter |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   3.432159   .2074197    16.55   0.000     3.025624    3.838694
    betaxInf |    .461547   .0618128     7.47   0.000     .3403963    .5826978
     lambda0 |   .0676789   .0841758     0.80   0.421    -.0973027    .2326605
      betaxL |  -.1870167   .0280581    -6.67   0.000    -.2420096   -.1320238
      betaxH |   .0108285    .013414     0.81   0.420    -.0154624    .0371194
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.2420096    .0371194
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. 
. reg voter sport if male, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4227
                                                       F(  1,  1080) =   20.50
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0053
                                                       Root MSE      =  .45734

                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
       voter |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       sport |   .0735529   .0162459     4.53   0.000     .0416758      .10543
       _cons |   .6476267    .014691    44.08   0.000     .6188005    .6764529
------------------------------------------------------------------------------

. 
. reg voter sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private urb
> an2 urban3 urban4   if male, rob clust(F1SCH_ID)

Linear regression                                      Number of obs =    4227
                                                       F( 32,  1080) =    9.57
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0684
                                                       Root MSE      =  .44423

                              (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
--------------------------------------------------------------------------------
               |               Robust
         voter |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         sport |   .0516061   .0157372     3.28   0.001     .0207272    .0824851
          by73 |   .0642387   .0444772     1.44   0.149    -.0230327    .1515102
          by74 |   .0919118    .043227     2.13   0.034     .0070933    .1767303
          by75 |  -.0468848   .0922205    -0.51   0.611    -.2278366    .1340669
   race_native |  -.0357211   .0725175    -0.49   0.622    -.1780123      .10657
    race_black |   .0342155   .0284087     1.20   0.229    -.0215269     .089958
     race_hisp |  -.0747031   .0261556    -2.86   0.004    -.1260247   -.0233815
      race_api |  -.2363001   .0303006    -7.80   0.000    -.2957548   -.1768455
     hh_father |   .0214284   .0179679     1.19   0.233    -.0138275    .0566843
     hh_mother |   .0166921   .0308387     0.54   0.588    -.0438185    .0772026
     ed_mother |   .0635537   .0181376     3.50   0.000     .0279647    .0991427
     ed_father |  -.0009862   .0190367    -0.05   0.959    -.0383394    .0363669
       inc_low |  -.0807054   .0213675    -3.78   0.000    -.1226319   -.0387789
      inc_high |   .0054599    .016238     0.34   0.737    -.0264016    .0373214
      math_irt |   .0018418   .0008673     2.12   0.034     .0001399    .0035437
      read_irt |   .0036894   .0011645     3.17   0.002     .0014043    .0059744
     frqabsent |   .0327688   .0342029     0.96   0.338    -.0343429    .0998804
      handicap |  -.0056254   .0534836    -0.11   0.916    -.1105689    .0993182
          enr2 |  -.0353252   .0305958    -1.15   0.249    -.0953592    .0247089
          enr3 |  -.0513783   .0304713    -1.69   0.092    -.1111681    .0084114
          enr4 |  -.0335385   .0289056    -1.16   0.246    -.0902561     .023179
          enr5 |  -.0481839   .0309001    -1.56   0.119    -.1088149     .012447
          enr6 |  -.0402793    .031077    -1.30   0.195    -.1012575    .0206988
          enr7 |  -.0189681   .0336305    -0.56   0.573    -.0849565    .0470204
          enr8 |  -.0497486   .0425384    -1.17   0.242    -.1332159    .0337187
          enr9 |  -.1023416   .0454335    -2.25   0.024    -.1914896   -.0131936
 cont_catholic |   .0137879    .028636     0.48   0.630    -.0424007    .0699765
cont_religious |  -.0231823   .0558582    -0.42   0.678    -.1327851    .0864205
  cont_private |   .0179614   .0361247     0.50   0.619    -.0529211    .0888438
        urban2 |  -.0328277   .0207231    -1.58   0.113    -.0734898    .0078344
        urban3 |  -.0148962   .0257884    -0.58   0.564    -.0654974    .0357049
        urban4 |  -.0232233   .0697549    -0.33   0.739    -.1600939    .1136472
         _cons |   .4520375    .065353     6.92   0.000     .3238042    .5802708
--------------------------------------------------------------------------------

. 
. rcr voter sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private urb
> an2 urban3 urban4   if male, clust(F1SCH_ID) lambda(-1 0)


RCR model                                             Number of obs =     4227
                                             Lower bound on lambda  =       -1
                                             Upper bound on lambda  =        0


                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
       voter |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.530593   .3284963    13.79   0.000     3.886752    5.174433
    betaxInf |   .5240382   .1208746     4.34   0.000     .2871284     .760948
     lambda0 |   .5370104   .1991842     2.70   0.007     .1466166    .9274043
      betaxL |   .0516061   .0156775     3.29   0.001     .0208788    .0823335
      betaxH |   .1275927   .0238026     5.36   0.000     .0809405    .1742449
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)      .0208788    .1742449
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr voter sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private urb
> an2 urban3 urban4   if male, clust(F1SCH_ID) lambda(0 .5)


RCR model                                             Number of obs =     4227
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =       .5


                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
       voter |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.530593   .3284963    13.79   0.000     3.886752    5.174433
    betaxInf |   .5240382   .1208746     4.34   0.000     .2871284     .760948
     lambda0 |   .5370104   .1991842     2.70   0.007     .1466166    .9274043
      betaxL |   .0038522   .0202589     0.19   0.849    -.0358546     .043559
      betaxH |   .0516061   .0156775     3.29   0.001     .0208788    .0823335
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.0358546    .0823335
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. rcr voter sport by73-by75 race_native race_black race_hisp race_api hh_* ed_*  inc_low inc_high math_irt read_irt frqabsent handicap enr2-enr9 cont_catholic cont_religious cont_private urb
> an2 urban3 urban4   if male, clust(F1SCH_ID)


RCR model                                             Number of obs =     4227
                                             Lower bound on lambda  =        0
                                             Upper bound on lambda  =        1


                            (Std. Err. adjusted for 1081 clusters in F1SCH_ID)
------------------------------------------------------------------------------
             |               Robust
       voter |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   lambdaInf |   4.530593   .3284963    13.79   0.000     3.886752    5.174433
    betaxInf |   .5240382   .1208746     4.34   0.000     .2871284     .760948
     lambda0 |   .5370104   .1991842     2.70   0.007     .1466166    .9274043
      betaxL |  -.0524799   .0305335    -1.72   0.086    -.1123245    .0073648
      betaxH |   .0516061   .0156775     3.29   0.001     .0208788    .0823335
-------------+----------------------------------------------------------------
       betax |    (Conservative confidence interval)     -.1123245    .0823335
------------------------------------------------------------------------------
Treatment Variable:   sport
Control Variables :   by73 by74 by75 race_native race_black race_hisp race_api
                      hh_father hh_mother ed_mother ed_father inc_low inc_high
                      math_irt read_irt frqabsent handicap enr2 enr3 enr4 enr5
                      enr6 enr7 enr8 enr9 cont_catholic cont_religious
                      cont_private urban2 urban3 urban4

. 
. log close
      name:  <unnamed>
       log:  /hpchome/econ/tmr17/HSsports/NELS88analysis/NELS88reg05_a.log
  log type:  text
 closed on:  22 Feb 2018, 19:06:15
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
